backend/app/Controllers/Admin/PaymentsAPI.php

    public function getNotifications()
    {
        $user_id = $this->request->user_id;

        $notificationsModel = new NotificationModel();
        $notifications = $notificationsModel
            ->where('user_id', $user_id)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = 26
ORDER BY `created_at` DESC