backend/app/Controllers/Users/TransactionController.php

    public function getTransactions()
    {
        $user_id = $this->request->user_id;

        if (!$user_id) {
            return $this->failUnauthorized('Utilisateur non authentifié.');
        }

        $transactionModel = new TransactionModel();
        $transactions = $transactionModel
            ->where('user_id', $user_id)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE `user_id` = 27
ORDER BY `created_at` DESC