backend/app/Controllers/Users/WalletController.php

SELECT *
FROM `wallets`
WHERE `user_id` = 28
 LIMIT 1
---
    public function index(){
        $user_id = $this->request->user_id;

        $wallet = (new WalletModel())->where('user_id', $user_id)->first();