backend/app/Controllers/Stat/StatController.php

        ")->getResult();

        // 💸 5️⃣ Transactions récentes
        $recentTransactions = $db->table('transactions')
            ->select('transactions.*, users.first_name, users.last_name')
            ->join('users', 'users.user_id = transactions.user_id', 'left')
            ->orderBy('transactions.created_at', 'DESC')
            ->limit(10)
            ->get()
            ->getResult();
---
SELECT `transactions`.*, `users`.`first_name`, `users`.`last_name`
FROM `transactions`
LEFT JOIN `users` ON `users`.`user_id` = `transactions`.`user_id`
ORDER BY `transactions`.`created_at` DESC
 LIMIT 10